ajuste fluxos e exemplos
